# AnalysisDisplayDiagramSettings Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayDiagramSettings Constructor
AnalysisDisplayDiagramSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayDiagramSettings()()()() | Constructs a default instance of diagram settings. |
| AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) | Constructs a new copy of the input AnalysisDisplayDiagramSettings object. |

# See Also
AnalysisDisplayDiagramSettings Class
AnalysisDisplayDiagramSettings Members
Autodesk.Revit.DB.Analysis Namespace